tutorials/SOAP/mod2/soapinsertvoter.txt

<?xml version="1.0" encoding="utf-8"?>   
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:urn="urn:enterprise.soap.sforce.com"
  xmlns:urn1="urn:sobject.enterprise.soap.sforce.com"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Header>
     <urn:SessionHeader>
        <urn:sessionId>TOKEN</urn:sessionId>
     </urn:SessionHeader>
     <urn:MruHeader>
         <urn:updateMru>false</urn:updateMru>
     </urn:MruHeader>
  </soapenv:Header>
  <soapenv:Body>
     <urn:create>
        <urn:sObjects xsi:type="urn1:Voter__c"> <!--Zero or more repetitions:-->
           <!--You may enter ANY elements at this point-->
           <Name>Joan Callamezzo</Name>
           <Precinct__c>a06G000000jvq9zIAA</Precinct__c>
	   <Mailing_Address__c>3920 255th Place Se, Sammamish WA 98029</Mailing_Address__c>
        </urn:sObjects>
     </urn:create>
  </soapenv:Body>
</soapenv:Envelope>